" set number " Нумеруем строки

syntax on " Подсветка синтаксиса

set expandtab " Заменяет TAB пробелами
set tabstop=4 " Устанавливает количество пробелов в одном TAB
set smarttab " TAB удаляется и добавляется по умному в начале строке (точнее до первого непробельного символа)
set shiftwidth=4 " Устанавливает количество пробелов для умного TAB в начале строки

set noerrorbells " Отключить звуки ошибок
set novisualbell " Отключить звуки ошибок

set ignorecase " При поиске строчных букв - игнорирует регистр
set smartcase " При поиске заглавных букв - не игнорирует регистр
set hlsearch " Подсветка при поиске
set incsearch " Динамический поиск (сразу показывает первое вхождение)

set encoding=utf8 " Кодировка используемая по умолчанию

" set list " Показать скрытые сисволы (конец строки, начало строки, TAB, пробел и т.д)
set listchars=space:· " В ручную зададим какие скрытые символы как показывать (прбел это ·)

set backspace=indent,eol,start " Backspace будет удалять символы в штатном режиме


"========================================================================================
" PLUGINS ===============================================================================
"========================================================================================
call plug#begin()
Plug 'mbbill/undotree' " Плагин для UNDO
set undofile " Сохранение действий для UNDO, даже после закрытия файла

" Plug 'vim-airline/vim-airline' " Красивая тема для информационной строки vim 
" Plug 'vim-airline/vim-airline-themes' " Цветовая схема информационной строки vim 

Plug 'itchyny/lightline.vim' " Красивая тема для информационной строки vim (minimal)
set laststatus=2 " Чтобы оно отображалась
set noshowmode " Убираем лишние инф. сообщения о моде

call plug#end()


"==================================================================
" HOTKEYS =========================================================
"==================================================================
" Ctrl + W + <arrow> - перемещение по undotree
" Ctrl + T - подробная информация о времени изменений
" Ctrl + D - скрыть/показать окошко diff
nnoremap <F5> :UndotreeToggle<CR> " Отркыть плагин для UNDO
map <F1> :set invnumber<CR> " Пронумеровать строки
map <F2> :set invlist<CR> " Показать спец символы
set pastetoggle=<F3> " Режим вставки (set paste)
